#include<stdio.h>

int main(){
	int n;
	scanf("%d",&n);
	int a[n],i,temp;
	for(i=0;i<n;i++){
		scanf("%d",&a[i]);
	}
	for(i=0;i<n/2;i++){
		temp=a[i];
		a[i]=a[n-1-i];
		a[n-1-i]=temp;
	}
	for(i=0;i<n;i++){
		if(i==n-1){
			printf("%d",a[i]);
		}else printf("%d ",a[i]);
		
	}
	return 0;
}



/*
  将一个数组中的值按逆序重新存放。例如，原来的顺序为 8,6,5,4,18,6,5,4,1。要求改为 1,4,5,6,81,4,5,6,8。
  
  输入格式
  输入为两行：第一行数组中元素的个数 n(1<n<100)n(1<n<100)，第二行是 nn 个整数（整数范围为 [-100, 100][−100,100]），每两个整数之间用空格分隔。
  
  输出格式
  输出为一行：输出逆序后数组的整数，每两个整数之间用空格分隔。
 */
