#include<stdio.h>
#include<math.h>
int sum(int *x,int n);
int max(int *x,int n);
int min(int *x,int n);

int main(){
	int t,a[24]={0},sum2,min3,max3;
	for(t=0;t<24;t++){
		printf("请输入在%d:00和%d:00之间登录的用户数：",t,t+1);
		scanf("%d",&a[t]);
	}
	sum2=sum(a,24);
	min3=min(a,24);
	max3=max(a,24);
	printf("   时间                 登录人数                 所占比例\n");
	for(t=0;t<24;t++){
		printf("%2d:00 - %2d:00 %15d %25.1f\n",t,t+1,a[t],(1.0*a[t]*100)/sum2);
		
	}
	printf("最大登录人数%d发生在%2d：00到%2d：00之间\n",a[max3],max3,max3+1);
	printf("最小登录人数%d发生在%2d：00到%2d：00之间\n",a[min3],min3,min3+1);
	return 0;
}
int sum(int *x,int n){
	int ret=0,i;
	for(i=0;i<n;i++){
		ret+=x[i];
	}
	return ret;
	
}
int max(int *x,int n){
	int i,max2;
	max2=0;
	for(i=1;i<n;i++){
		if(x[max2]<x[i]){
			max2=i;
		}
	}
	return max2;
}
int min(int *x,int n){
	int i,min2;
	min2=0;
	for(i=1;i<n;i++){
		if(x[min2]>x[i]){
			min2=i;
		}
	}
	return min2;
}

/*
  从键盘输入每小时登录网络的用户数到一个有24个整型元素的数组中。写一个程序以如下格式显示一个报告：
  时间			     登录人数		   所占比例
  0:00 – 1:00        		1                   0.3
  1:00 – 2:00             	2                   0.7
  …
  10:00 - 11:00    		27                  9.0
  11:00 - 12:00    		28                  9.3
  …
  23:00 - 24:00    		8                   2.7
  最大登录人数28发生在11：00到12：00之间
  最小登录人数 1发生在  0：00到 1：00之间(两个时间段登录人数相同时，取排在前面的时间)
  
 **输入格式要求："%d" 提示信息："请输入在%d:00和%d:00之间登录的用户数："
 **输出格式要求：
  "   时间                 登录人数                 所占比例\n"
  "%2d:00 - %2d:00 %15d %25.1f\n"
  "最大登录人数%d发生在%2d：00到%2d：00之间\n"
  "最小登录人数%d发生在%2d：00到%2d：00之间\n"
  
  程序运行示例：
  请输入在23:00和24:00之间登录的用户数：9
  时间                 登录人数                 所占比例
  0:00 -  1:00               3                       0.6
  1:00 -  2:00               8                       1.7
  2:00 -  3:00               2                       0.4
  3:00 -  4:00               3                       0.6
  4:00 -  5:00               1                       0.2
  5:00 -  6:00               0                       0.0
  6:00 -  7:00               0                       0.0
  7:00 -  8:00               0                       0.0
  8:00 -  9:00               7                       1.5
  9:00 - 10:00              56                      11.8
  10:00 - 11:00               4                       0.8
  11:00 - 12:00              34                       7.2
  12:00 - 13:00              56                      11.8
  13:00 - 14:00              56                      11.8
  14:00 - 15:00              34                       7.2
  15:00 - 16:00              13                       2.7
  16:00 - 17:00              12                       2.5
  17:00 - 18:00              10                       2.1
  18:00 - 19:00              56                      11.8
  19:00 - 20:00              78                      16.5
  20:00 - 21:00              12                       2.5
  21:00 - 22:00              12                       2.5
  22:00 - 23:00               7                       1.5
  23:00 - 24:00               9                       1.9
  最大登录人数78发生在19：00到20：00之间
  最小登录人数0发生在 5：00到 6：00之间
 */
